app/admin/courses.rb

SELECT "instructors".* FROM "instructors"
---
  form do |f|
    f.inputs do

      f.input :instructor, :as => :select, :collection => Instructor.all.collect {|step| [step.first_name, step.id] }