app/admin/students.rb

  form do |f|
    f.inputs do

      f.input :course_id, as: :select, collection: Course.all
---
SELECT "courses".* FROM "courses"