app/views/students/index.html.erb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
            <td> <%= link_to "download_pdf", download_path %> </td>
            <td> <%= link_to course.instructor.first_name, instructor_path(:id) %> </td>