app/controllers/instructors_controller.rb

  def index


    @course = Course.all
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
    @ins = Instructor.find_by(id: params[:id])
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]