app/controllers/students_controller.rb

SELECT "courses".* FROM "courses"
---
  def index

    @course = Course.all